def number_to_words(n):
    slovar_numbers = {
        1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять",
        6: "шесть", 7: "семь", 8: "восемь", 9: "девять",
        11: "одиннадцать", 12: "двенадцать", 13: "тринадцать", 14: "четырнадцать", 15: "пятнадцать",
        16: "шестнадцать", 17: "семнадцать", 18: "восемьнадцать", 19: "девятнадцать"
    }

    slovar_dozens = {
        10: "десять", 20: "двадцать", 30: "тридцать", 40: "сорок", 50: "пятьдесят",
        60: "шестьдесят", 70: "семьдесят", 80: "восемьдесят", 90: "девяносто"
    }

    if n < 20:
        print(slovar_numbers[n])
    elif n % 10 == 0:
        print(slovar_dozens[n])
    elif n > 20 or n < 100:
        print(slovar_dozens[(n // 10) * 10] + " " + slovar_numbers[n % 10])


number_to_words(11)
number_to_words(23)
number_to_words(30)
